Revit 2015 API
Family.Symbols Property
A set of all symbols (types) that belong to a Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2015.  Use Family.GetFamilySymbolIds() instead.")]
public FamilySymbolSet Symbols { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2015.  Use Family.GetFamilySymbolIds() instead.")> _
Public ReadOnly Property Symbols As FamilySymbolSet
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2015.  Use Family.GetFamilySymbolIds() instead.")]
public:
property FamilySymbolSet^ Symbols {
	FamilySymbolSet^ get ();
}
Remarks
Returns a read only set of all the symbols that belong to a particular family. The family symbol objects within this set can be used to swap an instance from one type to another.
See Also
Family Class
Autodesk.Revit.DB Namespace